<template>
    <div class="secret">

        <h2> 随心记软件隐私协议</h2>
        <br>
        <p> 更新日期：2023-2-23 生效日期：2023-2-23
        </p>
        <br>
        <h1>引言</h1>
        <br>
        <p> 随心记重视用户的隐私。您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的随心记服务息息相关，我们也希望您能够仔细阅读，并在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述向您解释，并提供了进一步说明的链接，以便您的理解.
        </p>
        <br>
        <strong>
            我们对本隐私权政策中与您的权益存在重大关系的条款用粗体字进行标注。如果您不同意本隐私权政策的部分或全部内容，您应立即停止使用随心记软件服务并通过软件客服与我们联系。您通过勾选、点击确认、同意授权等方式确认本隐私权政策或直接使用及继续使用我们的服务，都表示您同意我们按照本《隐私政策》收集、使用、储存和分享您的信息.
        </strong>
        <p>如您对本《隐私政策》或与本《隐私政策》相关的事宜有任何问题，请通过 www.shayujizhang.com 与我们联系
        </p>

        <h1> 我们可能收集的信息</h1>

        <p> 您在注册我们的账户或使用我们的服务时，向我们提供的相关个人信息，例如电话号码、电子邮件等;</p>

        <p> 您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息.
        </p>
        <h1>其他方分享的您的信息</h1>
        <p> 其他方使用我们的服务时所提供有关您的共享信息.
        </p>
        <h1> 我们获取的您的信息</h1>
        <p> 为了预防恶意程序，保障软件与服务的安全运行、提升运营的质量及效率，我们可能会收集如下信息：
            日志信息指您使用我们服务时，系统可能会通过 cookies、web beacon 或其他方式自动采集的技术信息，包括：
            设备或软件信息，例如您的移动设备、网页浏览器或您用于接入我们的服务的其他程序所提供的配置信息、您的IP地址和您的移动设备所用的版本和设备识别码;
            您在使用我们服务时搜索和浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情;
            有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息;
            您通过我们的服务进行通讯的信息，例如曾通讯的账号，以及通讯时间、数据和时长;
            您通过我们的服务分享的内容所包含的信息（元数据），例如拍摄或上传的共享照片或录像的日期、时间或地点等.
            为了保障软件与服务的安全运行，我们会收集您的应用安装列表、设备型号、设备名称、 设备唯一标识符（包括：IMEI、Android
            ID、IDFA、设备Mac地址）、语言设置、字体设置、操作系统和应用程序版本、登录IP地址、接入网络的方式、设备运行进程信息.
        </p>
        <h1>我们获取的设备权限</h1>

        <p>在具体提供服务的过程中我们可能需要调用您的一些设备权限，例如为上传图片的目的获得您的照片访问权限；为实现拍照和上传目的获得您的相机权限；为实现保存图片目的获取您的存储权限等，我们将在具体场景下以弹窗的形式询问并征得您的同意。您可以在设备的系统设置功能中选择打开或关闭相应的权限，从而允许或拒绝我们收集和使用您的个人信息.
        </p>

        <h1> 我们可能如何使用信息</h1>
        <p> 我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：
        </p>
        <br>
        <p> 向您提供服务;</p>
        <br>
        <p> 在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；</p>
        <p>帮助我们设计新服务，改善我们现有服务；</p> 使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、个性化的帮助服务和指示，或对您和其他使用我们服务的用户作出其他方面的回应;
        <p>向您提供与您更加相关的广告以替代普遍投放的广告;</p>
        <p> 评估我们服务中的广告和其他促销及推广活动的效果，并加以改善;</p>
        <p> 软件认证或管理软件升级;</p>
        <p>让您参与有关我们产品和服务的调查.</p>
        <br>
        <p> 为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过我们的某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。您可以在自主选择关闭个性化推荐（打开随心记-首页-购物返现-我的-个性化推荐开关-点击关闭），当您选择关闭个性化推荐后，您无法享受个性化推荐服务，但仍可继续浏览非个性化推荐内容。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。
        </p>

        <br>
        <p>在你分享或者接收被分享的信息、参加活动等情形下，我们需要在本地访问您的剪切板，读取其中的口令、分享码和链接，以实现跳转、分享、活动联动等功能或者服务。仅在本地识别出剪贴板内容属于随心记跳转、分享、活动联动等指令时才会将其上传我们的服务器，除此之外我们不会上传剪切板的其他信息至服务器.
        </p>
        <br>
        <strong> 当您在未登录的游客状态下使用app时，我们将不会收集您的订单等信息,也不会对您进行个性化推荐.
        </strong>
        <h1> 您如何访问和控制自己的个人信息</h1>

        <p>我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除您的个人信息时，我们可能会要求您进行身份验证，以保障您的账户安全.</p>


        <h1>访问您的个人信息</h1>

        <p>您可以通过手机设备接入按以下所列方式自行访问您的个人信息：
        </p>

        <p> 账户信息——如果您希望访问或编辑您的账户中的个人基本资料信息、更改您的头像等，您可以通过登录账号点击“我的”进入个人主页后点击头像进入“个人资料”执行此类操作。 更正或补充您的个人信息
        </p>

        <p> 当您发现我们处理的关于您的个人信息有错误时，您可以要求我们做出更正或补充。联系方式详见本政策“关于我们”部分.
        </p>

        <h1>删除您的个人信息</h1>

        <p>您也可以通过注销账户的方式，取消我们收集和使用您的个人信息的全部授权。在您注销账户后，除法律法规另有规定或者另与您另有书面约定，我们将停止使用并删除您的个人信息.
        </p>

        <p>在下列情形中，您可以向我们提出删除您的个人信息的请求：
        </p>

        <p>我们处理个人信息的行为违反法律法规或与您的约定的;</p> 我们对您的个人信息的收集和使用，未能获得您明确同意的;
        <p> 我们终止向您提供或您主动终止使用我们的产品或服务的.</p>
        <p> 如果您无法通过上述路径访问、更新或删除该等个人信息，您可以随时通过后附联系方式与我们取得联系，我们将在十五日内回复您请求.</p>

        <p> 当您删除个人信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。在您注销账号时我们将删除您的个人信息，但已经用于用户画像的匿名化处理信息或根据法律法规不得删除的情形除外.</p>

        <p>我们匿名化处理或删除您的个人信息时，如您的个人信息曾被共享，我们还会通知相关公司、组织或个人对您的个人信息做匿名化或删除处理.</p>

        <h1>个人信息主体注销账户</h1>

        <strong>您可随时通过手机客户端点击“我的”进入个人页面，再点击头像进入个人信息页面，然后点击页面最底部“注销账号”或联系我们注销此前注册的账户，联系方式详见本政策中列明的联系方式联系，在注销账户后我们将停止为您提供产品或服务，并依据您的要求删除您的个人信息，法律法规另有规定的除外.
        </strong>
        <h1>您个人信息的存储</h1>

        <p>在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内。在获得您的授权同意之前，您的个人信息不会向中华人民共和国境外传输和存储.
        </p>

        <p>您的相关信息保存将低于三年，如果超过三年我们将立即删除或做匿名化处理，但是您的个人账户注册信息在你申请注销前的账户持续存续期间，将由我们持续存储.
        </p>

        <h1>我们可能分享的信息</h1>

        <p>除以下情形外，未经您同意，我们以及我们的关联公司不会与任何第三方分享您的个人信息：
        </p>

        <p>我们以及我们的关联公司可能将您的个人信息与我们的关联公司、合作伙伴及第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商）分享，用作下列用途：
        </p>

        <p>向您提供我们的服务;</p>
        <p> 实现“我们可能如何使用信息”部分所述目的;</p>
        <p>履行我们在本《隐私政策》中的义务和行使我们的权利;</p>
        <p>理解、维护和改善我们的服务;</p>
        <p>如我们或我们的关联公司与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《隐私政策》及我们要求其遵守的其他适当的保密和安全措施;</p>
        <p> 随着我们业务的持续发展，我们以及我们的关联公司有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移;</p>
        <p>我们或我们的关联公司还可能为以下需要保留、保存或披露您的个人信息：</p>
        <p>遵守适用的法律法规;</p>
        <p>遵守法院命令或其他法律程序的规定;</p>
        <p>遵守相关政府机关的要求;</p>
        <p>为遵守适用的法律法规、维护社会公共利益、或保护我们或我们的集团公司、我们的客户、其他用户或雇员的人身和财产安全或合法权益所合理必需的用途.</p>

        <h1>信息安全</h1>

        <p>我们仅在本《隐私政策》所述目的所必需期间和法律法规要求的时限内保留您的个人信息.</p>


        <p>我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如,在某些服务中,我们将利用加密技术(例如SSL)来保护您提供的个人信息。但请您谅解，由于技术的限制以及以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。当您发现安全弱点和可疑事件时请及时报告，不要私自尝试验证弱点.
        </p>


        <h1>我们可能如何收集信息</h1>

        <strong>cookies和web beacon的使用</strong>

        <p> 我们或我们的第三方合作伙伴，可能通过 cookies 和 web beacon 收集和使用您的信息，并将该等信息储存为日志信息.</p>


        <p>我们使用自己的 cookies 和 web beacon,目的是为您提供更个性化的用户体验和服务,并用于以下用途：</p>


        <p>记住您的身份。例如:cookies 和 web beacon 有助于我们辨认您作为我们的注册用户的身份;</p>

        <p>分析您使用我们服务的情况。例如，我们可利用 cookies 和 web beacon 来了解您使用我们的服务进行什么活动、或哪些网页或服务最受欢迎;</p>

        <p>广告优化。cookies 和 web beacon 有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放.</p>

        <p> 我们为上述目的使用 cookies 和 web beacon 的同时，可能将通过 cookies 和 web beacon</p>
        <p> 收集的非个人身份信息，经统计加工后提供给广告商或其他合作伙伴，用于分析用户如何使用我们的服务，并用于广告服务.</p>

        <p> 我们的产品和服务上可能会有广告商或其他合作方放置的 cookies 和 web beacon。这些 cookies 和 web beacon</p>
        <p> 可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务，或用于评估广告服务的效果。这些第三方 cookies 和 web beacon</p>
        <p> 收集和使用该等信息，不受本《隐私政策》约束，而是受相关使用者的隐私政策约束，我们不对第三方的 cookies 或 web beacon 承担责任.</p>


        <p> 您可以通过浏览器设置拒绝或管理 cookies 或 web beacon。但请注意,如果停用 cookies 或 web
            beacon,您有可能无法享受最佳的服务体验，某些服务也可能无法正常使用。同时，您还会收到同样数量的广告，但这些广告与您的相关性会降低。</p>


        <h1>第三方SDK的使用</h1>

        <p>为了保障我们客户端的稳定运行、功能实现,使您能够使用和享受更多的服务及功能,我们的应用中会嵌入授权合作伙伴的SDK或其他应用程序。此时，第三方SDK服务商可能会收集您的相关信息.</p>


        <p>我们可能向您发送的邮件和信息</p>
        <p>邮件和信息推送</p>


        <p>您在使用我们的服务时，我们可能使用您的信息向您的设备发送电子邮件、新闻或推送通知。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅</p>.


        <h1>隐私政策的适用例外</h1>
        <p>我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。例如：</p>


        <p> 您利用“分享”键将某些内容分享到我们的服务，或您利用第三方连线服务登录我们的服务。这些功能可能会收集您的相关信息（包括您的日志信息），并可能在您的电脑装置 cookies，从而正常运行上述功能;</p>


        <p>我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站.</p>


        <p>该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非《通用服务条款》或本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任.
        </p>


        <h1>未成年人使用我们的服务</h1>

        <p>我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导.</p>


        <h1>隐私政策的适用范围</h1>

        <p> 除某些特定服务外，我们所有的服务均适用本《隐私政策>.这些特定服务将适用特定的隐私政策。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本《隐私政策》的一部分。如任何特定服务的隐私政策与本《隐私政策》有不一致之处，则适用特定服务的隐私政策.
        </p>


        <h1>请您注意，本《隐私政策》不适用于以下情况：</h1>

        <p> 通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息;</p>


        <p>通过在我们服务中进行广告服务的其他公司和机构所收集的信息.</p>


        <h1>变更</h1>

        <p> 我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您，在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束.
        </p>


        <h1>关于我们</h1>

        <h1>最终解释权归去南京整薯条团队所有</h1>

    </div>
</template>

<script>
export default {
    name: 'secret',
    data() {

    },
    methods: {

    }
}
</script>
<style lang="less" scoped></style>